{"names": "Gryffindor1971", "reviewerLink": "/gp/profile/amzn1.account.AFYATPLMIEZQGXQWABNILJIINZFQ", "reviewTitles": "Good drive", "reviewBody": "Excellent! Only issue I had was I did not know this was formatted in X-FAT32. I bought this thumb drive to put the movies I have on my PC on it so that I could watch them in my living room on my smart tv... after spending a couple hours transferring files to the drive, I plug it into my smart tv and get an error telling me that the drive was not supported. I tried it on my Sony Blu-ray that has a usb slot for external media and it doesn’t recognize the drive either. I tell my husband about it and he says I need to format the thumb drive with a regular FAT32 file system. Well, I did as I was instructed, reloaded the movies after formatting with FAT32 and bingo! Both my smart tv and my Blu-ray can now read the files on the drive! So, if anyone has problems with your devices reading or even recognizing the drive after loading files in the X-FAT32 format, reformat the drive with FAT32 and then reload your files. You should be good to go! SANDISK, YOU REALLY SHOULD LABLE THE PACKAGING WITH THE TYPE OF FORMATING ON THE DRIVE! That would save people a lot of wasted time knowing this in advance!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 3, 2017", "starRating": "5.0 out of 5 stars", "helpful": "531 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Denis K", "reviewerLink": "/gp/profile/amzn1.account.AHVRQ2F6723IXOL2VOYHCVYJLPKA", "reviewTitles": "Flash drive works well, but included software not needed", "reviewBody": "The flash drive works well out of the box. The slider allows the user to protect the USB connector when not in use. It extends the connector and locks it in place when needed. However, the included SanDiskSecure Access software is confusing, because its \"Download for Mac\" document makes it seem that it is necessary to install in order to use the flash drive. But the software is intended to set up encryption and password protection for data on the drive. This is not needed for most users who just want to transfer data. I removed the software installer from this drive to free up space.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 15, 2018", "starRating": "4.0 out of 5 stars", "helpful": "225 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Marc Nuss", "reviewerLink": "/gp/profile/amzn1.account.AHTTBNFY7S4LIGFFFGDOLQ2KBFZQ", "reviewTitles": "Beware of the Secure Vault Feature", "reviewBody": "has fairly good capacity for the $$ but is pretty slow, and, BEWARE OF THE SECURE VAULT feature, as it password protects the files you put in, but then does not recognize the password you used (i even wrote mine down, ensured caps weren't on, and double checked my typing), and then you cannot access the files you are trying to secure, and, there is no way to reset the password, and you have to delete the whole thing...USELESS!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 9, 2017", "starRating": "1.0 out of 5 stars", "helpful": "231 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "TimDouglass", "reviewerLink": "/gp/profile/amzn1.account.AEF32MPLGMEEOHGJMGVV2SUGNXUA", "reviewTitles": "Will not work and can't be returned.", "reviewBody": "Seemed OK at first, but the videos I was trying to play from it kept having errors. Tried to re-format and it will no longer function at all. Want to return it, but even though I supposedly have 2 more weeks on the return period Amazon says it's not eligible for return. Totally not happy. Even the promotional flash drives I've gotten at trade shows work better.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 2, 2017", "starRating": "1.0 out of 5 stars", "helpful": "162 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Joesab", "reviewerLink": "/gp/profile/amzn1.account.AFUHBCC7K2XT6VWIHJSLABO4ZQNQ", "reviewTitles": "Worse write speeds of any name brand drive I've had, 4.5MB/s (read is decent at 35MB/s)", "reviewBody": "I was looking for a cheap drive and was OK with 2.0 speeds but the write speeds at 4.5MB/s on this are much worse, about what you get with a cheap give-away drive.Read speeds are a decent 35 MB/s. This drive would be OK if you rarely wrote to it and mostly used it for reading -- or you don't care about the write speed.This is the last SanDisk drive I will buy, I have 3 and they all suck on write speeds.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on February 8, 2018", "starRating": "1.0 out of 5 stars", "helpful": "122 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Batman", "reviewerLink": "/gp/profile/amzn1.account.AGETSYUITOWSVFFI4GHIEJZKNEQA", "reviewTitles": "Speed Drops out of the box", "reviewBody": "This drive has a speed drop on every transfer, going from 18 MB/s to 2 MB/s. On the files I transferred, there was at least two speed drops each time. For perspective, this meant transfers that should take 1 minute each could take up to 3 or more minutes. The performance was like this out of the box. It's unacceptable for a product to be unable to consistently deliver target speeds out of the box, brand new. SanDisk was a go-to brand for storage, but with this experience it's clear something has changed in the quality. I'd say stay away from this drive and find something with more reliable speeds unless you have alot of time to waste. I'll be pursuing a refund if these speed drops don't stop.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 25, 2017", "starRating": "1.0 out of 5 stars", "helpful": "120 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "SCM", "reviewerLink": "/gp/profile/amzn1.account.AGWVE2WLNK7KCV4Y5XXWVYE4AH6A", "reviewTitles": "Stopped working after a week with a critical error. ...", "reviewBody": "Stopped working after a week with a critical error. Sandisk website says they are aware of the error and there is no fix, only to return it for a refund. The problem ONLY effects the 16gb cruzer.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 4, 2018", "starRating": "1.0 out of 5 stars", "helpful": "58 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Amazon Customer", "reviewerLink": "/gp/profile/amzn1.account.AFG3Y6WA5QOUBYKV64GDRDQF3WGQ", "reviewTitles": "SanDisk application not working for Windows 10", "reviewBody": "I could not get the .exe file to update. A window pops up that there is an update and it downloads the update but fails to start the SanDisk software application. Everytime I click on the .exe file it wants to run the update again. I can manually move files to the USB drive but the SanDisk application will not start. The packaging and the product information is vague what operating systems it is compatible with. I read reviews and answers to questions on Amazon stating it works with the Windows 10 operating system version prior to purchase. We also purchased a 32GB SanDisk flash drive(same version)in the frustration free packaging and we are experiencing the same \"won't update software\" symptoms. The product information needs to be more specific for these flash drives.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 20, 2017", "starRating": "2.0 out of 5 stars", "helpful": "52 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "MPM", "reviewerLink": "/gp/profile/amzn1.account.AFHIL4L3ZWEYBWIA3FRBP2PKGAQQ", "reviewTitles": "EXTREMELY SLOW WRITING SPEEDS, THEN COMPLETELY DIED AFTER 10 MINUTES, OTHER PROBLEMS", "reviewBody": "At first the drivers wouldn't load while plugged into a USB3.0 slot, had to plug into USB2.0 to load drivers, not discoverable otherwise. Then I put the flash drive back into the USB3.0 port, and began transferring some music files. About ten minutes go by, I notice that the estimated time for transfer completion is over 2 hours for 28Gb, and write speeds were at 6!!!!!! Mb per second. This is TEN times slower than what normal rates are for USB2.0, and 100 times slower than normal rates on USB3.0. I stopped the transfer, and attempted to click \"properties\" a window pops up, says I don't have permission to access. I try to format the drive, maybe that will work... says the same thing. I literally can't even view the empty folders I just transferred over...A side note... This item's order took A FULL WEEK to be processed, before it even had a tracking number. Took two full weeks to show up.Another side note... This items was placed in the same shipping box as a FOURTY POUND ITEM, and there was a bunch of extra space, with no padding. Flash drive was just hanging out, getting pummeled.A+ transaction amazon! (sarcasm)", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 6, 2018", "starRating": "1.0 out of 5 stars", "helpful": "21 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Roman", "reviewerLink": "/gp/profile/amzn1.account.AEIYSVAP2MVBAJTZEFCFSEHN2T5A", "reviewTitles": "And the Answer is:", "reviewBody": "Why these special objects, in this case, the SanDisk 16GB 2.0 Flash Cruzer Glide USB Drive (SDCZ60-16G-B35), I am told is really quite simple to operate. I promise I can read, but I am typically unhappy when I fumble through todays technology regardless of its presumed simplicity or arranged madness for an over-the-hill type such as myself. I still rely on INSTRUCTIONS in order to make wishes, ambitions, and hopes become a reality. In my youth, it took me two days and a roll of surgical tape to learn to shave, and now I struggle with an object without a razor nor shaving cream, its called a SanDisk and I remain befuddled, too human to ask anyone to tell me how to employ the value of this miraculous technological device. . YouTube seems to have the answers, but again this foreign sounding language associated with todays technology adds to my greying hair and high blood pressure. Any ideas for instruction with this product?", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 9, 2018", "starRating": "4.0 out of 5 stars", "helpful": "18 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Aaron", "reviewerLink": "/gp/profile/amzn1.account.AH6RQK77F5CAZY7RDZJ4TOLCNPHQ", "reviewTitles": "Has 85 watt RTX 3070, not 130W watt as advertised on the spec sheet", "reviewBody": "This laptop has an 85W 3070 that performs similar if not worse than a high power 3060. The spec sheet for this model states that it has a 130W max 3070. I spoke with MSI support and the going theory is that there's a typo on the spec sheet. I will be returning this and replacing with a laptop with a higher performing 3070.Edit: MSI has corrected the spec sheet and it now lists 3070 max 85W.Beyond the mix up with the GPU max power, the build quality of the laptop is decent if not good. The keyboard feels nice enough to type on and the backlit keys look good. The screen is nothing to write home about but is adequate. No mux switch. The cooling is decent, although fans are of course loud - during combined stress test with looping fire strike extreme, in extreme performance mode in MSI center with fans on auto, the CPU rarely dropped below 4500Mhz and the GPU only throttled slightly at around 81-82C. Fans showed 50dB on an android sound meter app. The battery is on the small side, so I only saw about 3.5 hours of charge on battery saver and lower brightness / turning off keyboard backlight.Changing my 1 star review to 3 stars because the laptop isn't terrible, I just don't appreciate being misled on such an important spec.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 29, 2021", "starRating": "3.0 out of 5 stars", "helpful": "137 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "K. O.", "reviewerLink": "/gp/profile/amzn1.account.AEHOQAERS23VRE5AZG7UWYDGMSOQ", "reviewTitles": "85 watt graphics card, no Displayport, no VR, Ever, sudden shutoffs, missing factory tag, gets hot.", "reviewBody": "I purchaseed this laptop because MSI and Amazon advertised it as a gaming machine for $1500 with RTX 3070 with a 130watt tgp.After I received it i found out that my laptop was missing a factory seal on the bottom, I also found out that the \"130w tgp\" was a \"misprint\" and that the graphics card (rtx 3070) ran at the lowest possible wattage, \"up to 85 watt with boost\". The ONLY reason for buying this laptop was gone. In addition to this blatant and very obvious marketing trick (see \"false advertisement\") I also found out that this 2021, modern 'gaming' laptop was not equipped for VR, could not connect two external monitors, the HDMI rating went from 2.1 to 2.0 (another so-called misprint), which meant 4K ran at 60hz, 8k wasn't possible at all and, thanks to absence of video/thunderbolt support usb-c there was no way to ever connect a decent VR headset, which meant that if I ever wanted to use HP Reverb 2 I would have to buy a new pc.In addition, there are other issues: the usb rating (usb 3.1 gen 2) is a rebranded, confusing way of saying that this, again, 2021 gaming laptop only has an old USB 3.0 without video, no displayport, the 180watt power supply gets very hot, same as the motherboard and the ssd, there is no sata port (blocked by a poorly placed battery), no Dolby (they use something called Nahimic, it's horrible), the display has a native refresh rate of only 100hz and needs overdrive enabled to run at 144, it's also of a very poor quality and mainly displays blue colors, making everything look very unnatural.Lastly, something that forced me to return it, was the fact that, in the middle of the game or when downloading many files, the system would just shut off on its own!!! I suffered 20 or 30 shutdowns before I called amazon and set up the return. Seriously, how cheap do you have to be to remove a feature from the Usb-c port that even my old Lenovo has? My Lenovo isn't a gaming laptop and yet, being 5 years old, it can easily connect two additional monitors and display images on ALL OF THEM! Which isn't something I can do with MSI.I know they did this to distinguish this budget, bargain-basement model from their higher-end offerings but why make it in the first place? Also, what kind of a marketing team you have that allowed for misrepresentation of the very reason your end users would buy this laptop?! Msi should have known that almost every person who ended up finding out that the graphics card can't go naive 70 watts would return the laptop, which meant reselling it as used, aka losing money on every single one sold.Thank you for wasting my time, msi, I really appreciate the opportunity to buy and then return a semi-functioning laptop that never panned out.Other issues is thag its very noisy, very loud, processor throttles early and doesn't ever reach maximum frequency, plasticky, flimsy build, the TouchPad is difficult to operate, the rgb keyboard brightness can't be adjusted nor can ever be used effectively, it's also brighter than the very dim display. The display is NOT HRD, with about 58% srgb coverage, very poor quality.Comes with a slow-usb Kingston ssd, ram is fast but has high latency for some reason, the clock can't be adjusted because the BIOS is a pure mess.I can go on and on but, all I can really say is this: don't buy it! Spend couple of hundred dollars more and buy a vastly superior QHD HP Omen 17, with a potent 140watt 3070, gorgeous qhd screen, fully enabled 11800h, better ram, thunderbolt/usb/pcie4.Amazon said they won't charge me anything to return this piece of you-know-what, can't wait to see if they told the truth.I won't buy another msi product ever again. The first msi laptop with GeForce 1070 almost burnt down my entire house, when it shorted and caught fire... This one is just a big disappointment.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 2, 2021", "starRating": "1.0 out of 5 stars", "helpful": "122 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "shasta", "reviewerLink": "/gp/profile/amzn1.account.AGNIUTY5VT24LUZFBLAHDB62FRTQ", "reviewTitles": "Great upgrade!", "reviewBody": "It's smaller than my last one, so it fits my cooling board. I love that the keyboard can change color. The screen has no glare which is amazing. Never had a laptop that didn't have glare. My games look fantastic, it's almost like starting a new game. I haven't done a lot with is yet, but its worth the money. Very happy I didn't go with the other laptops I was looking at. This is by far the best one I have owned. I love how loud it can get. My last laptop even with the sound all the way up I can't hear the games or shows. Very happy with this laptop. It loads things very fast which is nice. It's much lighter than my last one, so it's easier to move around. Not big and bulky. Very excited to have this. It has an extra fan you can turn on and off if it gets hot as well.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 1, 2021", "starRating": "5.0 out of 5 stars", "helpful": "43 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "David Lara", "reviewerLink": "/gp/profile/amzn1.account.AFMIWKAV7ZLTQV67M2KWCLYSFFBA", "reviewTitles": "Excellent product, good performance combined with elegance", "reviewBody": "Very fast shipping to Chile, about 1 week, I am very happy with this product, all the games I have tried have had an excellent performance, including games like \"Control\" and \"R6\".It is a lightweight and very powerful computer with a high quality screen.It has a unique and beautiful design. The price I find is according to the power that is delivered.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 3, 2021", "starRating": "5.0 out of 5 stars", "helpful": "45 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "Amazon Customer", "reviewerLink": "/gp/profile/amzn1.account.AERS2X7DBXFPQLHK6ZH24BRUBX6A", "reviewTitles": "85W GPU, otherwise okay", "reviewBody": "Keyboard is kinda small, touchpad is horrible and the fans can get loud. GPU is only 85W and not 130W as advertised at MSI website but conviently amazon didnt list the specs so theres nothing we can do. Otherwise than that runs quickly, screen is okay but kinda wobbly.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 2, 2021", "starRating": "2.0 out of 5 stars", "helpful": "42 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "Allen Tep", "reviewerLink": "/gp/profile/amzn1.account.AHTVSOZAM64PLL33FJY6I225EA5Q", "reviewTitles": "4k gaming - EDITED slow computer", "reviewBody": "Delivery - 5/5 - Came after a week about without prime. Great speed!Packaging - 3/5 - Amazon, why did you send it without any packaging? Meh, it's ok I guess.Price - 5/5 - One of the best prices, but it is a budget build... for a 3070 with not much holding it back this is high up on the list for me though!Size - 5/5 - Great compared to my old sager from 4 years ago which I am switching from. So compact!Other points: Not 17 inches... but my TV is bigger so who cares? HDMI is on the side, not like my Sager4k Gaming - 5/5 - I am currently playing BreathEdge and its taking my breath away. This is a beast.So far so good!---Edit: Returned and upset1/5 - Promised headset for review, but no headset. No response. Form incomplete. Why provide this ad in the package and not give anything?1/5 - Performance was subpar. I got a Lenovo with 140w vs this thing sucking only half the electricity and giving half the performance for the same money, I mean I don't care for the electricity bill as much because my goal was a performance laptop when buying a GPU with 3070 on it1/5 - They \"misprinted\" the specs for this model on their own website1/5 - touchpad really bad, I mean I use a mouse, but this thing was pretty off, might as well not have a touchpad from it's quality1/5 - Cyberpunk was laggy here (like 25 frames a second and going to 15 or 10 every minute) vs playing smoothly on the new laptop5/5 availability - hard to get a good lenovo laptop", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 30, 2021", "starRating": "1.0 out of 5 stars", "helpful": "14 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "Grenn", "reviewerLink": "/gp/profile/amzn1.account.AGPVELZM7X7DKLEK6VUEOPVKOKNA", "reviewTitles": "Faulty cooling system that require a copper shim", "reviewBody": "Besides the 80w 3070 switcheroo that msi pulled on us, my particular laptop had a fault in the cooling system. The copper plate that goes over the cpu die only makes 20% contact on the left side. The right side is completely angled up. In order to alleviate this, I placed a 20mm x 20mm x 1mm copper shim between the cpu die and the copper plate of the cooling system.Now it makes full contact, but the cooling is still kinda meh. Even with a -65mv undervolt and a cooling pad, I couldn't sustain the full 4.2ghz clock speed during testing, instead it drops to ~3.4ghz. Still, I got a cinebench r23 score of 10955. Not nearly as good as the 11800h in the mp66 version of this laptop. One dude on reddit received a score of 14603 with a 4.4ghz all core overclock, so that's a testament on how powerful the 11800h is.Some positives: the 80w 3070 (that's the target tgp, 85 is the tgp limit) performs similarly to a desktop 3060 and has a bit of cooling headroom. I personally got an undervolt-overclock of 1530mhz @ .700v. If you're up for it, you could probably flash the vbios with a more powerful 3070 mobile chip. Just make sure to clamp down on the voltage if the tgp of the vbios is 115w+.Also, the chassis has enough room to put thick heatsinks on the nvme drives.Overall, I think I'm gonna try the msi mg66 with the 125w 3070 since videos on line show it has better cooling.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 9, 2021", "starRating": "3.0 out of 5 stars", "helpful": "5 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "Amazon Customer", "reviewerLink": "/gp/profile/amzn1.account.AGZCKLV35T6623UEPHNPDFVZR6JA", "reviewTitles": "I love this laptop1", "reviewBody": "I wanted a screaming fast laptop and this one delivers! The 11th generation i7 chip really delivers. It can easily handle Zoom, databases, Office 365 all at the same time with no issues. Plus, the changing-cool keyboard is cool! I'm not a gamer, but I need a gamer-level machine for all that I do. Highly recommend the Pulse for the price and the features. It's much cheaper than the new Surface laptop and has a bigger display,.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 22, 2021", "starRating": "5.0 out of 5 stars", "helpful": "5 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "Dan Doucet", "reviewerLink": "/gp/profile/amzn1.account.AEYFFZ42CFODLDIGT4WEXRJUU6SQ", "reviewTitles": "Almost perfect BUT!", "reviewBody": "Buyer Beware. Battery Swapped lose SSD slot....I bought this laptop for 3 reasons. 1. Gaming Portability 2. GTX 3070 3. Fast storage drives!The GL66 is advertised as having 2 M.2 SSD slots and 1 2.5 SSD slot. It has those slots, with one already being used with a 512GB M.2 drive.I was looking forward to using my 2.5in 2TB SSD drive that I had bought earlier. BUT! I cannot use the drive because my laptop came with a bigger battery 85W instead of the 53W that is advertised online. Because of this the 2.5 SSD slot is not available the bigger battery covers the slot. I do not need the bigger battery I want the SSD slot.I have contacted MSI and apparently they are not going to do anything about it. Just send me the smaller battery so I can use the 2.5 SSD slot is all I ask, they countered with, \"well you have a better battery!\"You advertise a product and the customer should get what they order. Yes I got a better battery but I lost the functionality of a very much needed SSD slot.If MSI is reading this please send me the right battery so I can use that slot is all I am asking. Other than that I could not be happier.In closing I am already trying to find the 53W battery online so I can purchase it myself and swap it out!I really would prefer that MSI sends me the right battery and I would change this review to 5 stars!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on September 23, 2021", "starRating": "4.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "Luis Duran", "reviewerLink": "/gp/profile/amzn1.account.AE3LX3VC37DLLRCCKVP4WVK7Z3IQ", "reviewTitles": "Great for gaming and power video editing! Q", "reviewBody": "Finally a good 3070 laptop, in a good range of price, with all you need for gaming. The construction of this PC seems to be more reliable than the other one I got, the gl65 with 2070. Is more metal than the plastic case of the gl65 and for me that's a win in terms of desing.I've play some of the most demanding games and runs smooth, without getting any hotter. But this is a 1 day review. Let me try it for one month. At the moment, no screens light leaks, the keyboard is ok, even of you are using it with external keyboard, it looks amazing.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 3, 2021", "starRating": "5.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/MSI-GL66-Gaming-Laptop-i7-11800H/product-reviews/B09127DDVT?pageNumber=2&reviewerType=all_reviews"}
{"names": "Gryffindor1971", "reviewerLink": "/gp/profile/amzn1.account.AFYATPLMIEZQGXQWABNILJIINZFQ", "reviewTitles": "Good drive", "reviewBody": "Excellent! Only issue I had was I did not know this was formatted in X-FAT32. I bought this thumb drive to put the movies I have on my PC on it so that I could watch them in my living room on my smart tv... after spending a couple hours transferring files to the drive, I plug it into my smart tv and get an error telling me that the drive was not supported. I tried it on my Sony Blu-ray that has a usb slot for external media and it doesn’t recognize the drive either. I tell my husband about it and he says I need to format the thumb drive with a regular FAT32 file system. Well, I did as I was instructed, reloaded the movies after formatting with FAT32 and bingo! Both my smart tv and my Blu-ray can now read the files on the drive! So, if anyone has problems with your devices reading or even recognizing the drive after loading files in the X-FAT32 format, reformat the drive with FAT32 and then reload your files. You should be good to go! SANDISK, YOU REALLY SHOULD LABLE THE PACKAGING WITH THE TYPE OF FORMATING ON THE DRIVE! That would save people a lot of wasted time knowing this in advance!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 3, 2017", "starRating": "5.0 out of 5 stars", "helpful": "531 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Denis K", "reviewerLink": "/gp/profile/amzn1.account.AHVRQ2F6723IXOL2VOYHCVYJLPKA", "reviewTitles": "Flash drive works well, but included software not needed", "reviewBody": "The flash drive works well out of the box. The slider allows the user to protect the USB connector when not in use. It extends the connector and locks it in place when needed. However, the included SanDiskSecure Access software is confusing, because its \"Download for Mac\" document makes it seem that it is necessary to install in order to use the flash drive. But the software is intended to set up encryption and password protection for data on the drive. This is not needed for most users who just want to transfer data. I removed the software installer from this drive to free up space.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 15, 2018", "starRating": "4.0 out of 5 stars", "helpful": "225 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Marc Nuss", "reviewerLink": "/gp/profile/amzn1.account.AHTTBNFY7S4LIGFFFGDOLQ2KBFZQ", "reviewTitles": "Beware of the Secure Vault Feature", "reviewBody": "has fairly good capacity for the $$ but is pretty slow, and, BEWARE OF THE SECURE VAULT feature, as it password protects the files you put in, but then does not recognize the password you used (i even wrote mine down, ensured caps weren't on, and double checked my typing), and then you cannot access the files you are trying to secure, and, there is no way to reset the password, and you have to delete the whole thing...USELESS!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 9, 2017", "starRating": "1.0 out of 5 stars", "helpful": "231 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "TimDouglass", "reviewerLink": "/gp/profile/amzn1.account.AEF32MPLGMEEOHGJMGVV2SUGNXUA", "reviewTitles": "Will not work and can't be returned.", "reviewBody": "Seemed OK at first, but the videos I was trying to play from it kept having errors. Tried to re-format and it will no longer function at all. Want to return it, but even though I supposedly have 2 more weeks on the return period Amazon says it's not eligible for return. Totally not happy. Even the promotional flash drives I've gotten at trade shows work better.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 2, 2017", "starRating": "1.0 out of 5 stars", "helpful": "162 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Joesab", "reviewerLink": "/gp/profile/amzn1.account.AFUHBCC7K2XT6VWIHJSLABO4ZQNQ", "reviewTitles": "Worse write speeds of any name brand drive I've had, 4.5MB/s (read is decent at 35MB/s)", "reviewBody": "I was looking for a cheap drive and was OK with 2.0 speeds but the write speeds at 4.5MB/s on this are much worse, about what you get with a cheap give-away drive.Read speeds are a decent 35 MB/s. This drive would be OK if you rarely wrote to it and mostly used it for reading -- or you don't care about the write speed.This is the last SanDisk drive I will buy, I have 3 and they all suck on write speeds.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on February 8, 2018", "starRating": "1.0 out of 5 stars", "helpful": "122 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Batman", "reviewerLink": "/gp/profile/amzn1.account.AGETSYUITOWSVFFI4GHIEJZKNEQA", "reviewTitles": "Speed Drops out of the box", "reviewBody": "This drive has a speed drop on every transfer, going from 18 MB/s to 2 MB/s. On the files I transferred, there was at least two speed drops each time. For perspective, this meant transfers that should take 1 minute each could take up to 3 or more minutes. The performance was like this out of the box. It's unacceptable for a product to be unable to consistently deliver target speeds out of the box, brand new. SanDisk was a go-to brand for storage, but with this experience it's clear something has changed in the quality. I'd say stay away from this drive and find something with more reliable speeds unless you have alot of time to waste. I'll be pursuing a refund if these speed drops don't stop.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 25, 2017", "starRating": "1.0 out of 5 stars", "helpful": "120 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "SCM", "reviewerLink": "/gp/profile/amzn1.account.AGWVE2WLNK7KCV4Y5XXWVYE4AH6A", "reviewTitles": "Stopped working after a week with a critical error. ...", "reviewBody": "Stopped working after a week with a critical error. Sandisk website says they are aware of the error and there is no fix, only to return it for a refund. The problem ONLY effects the 16gb cruzer.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 4, 2018", "starRating": "1.0 out of 5 stars", "helpful": "58 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Amazon Customer", "reviewerLink": "/gp/profile/amzn1.account.AFG3Y6WA5QOUBYKV64GDRDQF3WGQ", "reviewTitles": "SanDisk application not working for Windows 10", "reviewBody": "I could not get the .exe file to update. A window pops up that there is an update and it downloads the update but fails to start the SanDisk software application. Everytime I click on the .exe file it wants to run the update again. I can manually move files to the USB drive but the SanDisk application will not start. The packaging and the product information is vague what operating systems it is compatible with. I read reviews and answers to questions on Amazon stating it works with the Windows 10 operating system version prior to purchase. We also purchased a 32GB SanDisk flash drive(same version)in the frustration free packaging and we are experiencing the same \"won't update software\" symptoms. The product information needs to be more specific for these flash drives.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 20, 2017", "starRating": "2.0 out of 5 stars", "helpful": "52 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "MPM", "reviewerLink": "/gp/profile/amzn1.account.AFHIL4L3ZWEYBWIA3FRBP2PKGAQQ", "reviewTitles": "EXTREMELY SLOW WRITING SPEEDS, THEN COMPLETELY DIED AFTER 10 MINUTES, OTHER PROBLEMS", "reviewBody": "At first the drivers wouldn't load while plugged into a USB3.0 slot, had to plug into USB2.0 to load drivers, not discoverable otherwise. Then I put the flash drive back into the USB3.0 port, and began transferring some music files. About ten minutes go by, I notice that the estimated time for transfer completion is over 2 hours for 28Gb, and write speeds were at 6!!!!!! Mb per second. This is TEN times slower than what normal rates are for USB2.0, and 100 times slower than normal rates on USB3.0. I stopped the transfer, and attempted to click \"properties\" a window pops up, says I don't have permission to access. I try to format the drive, maybe that will work... says the same thing. I literally can't even view the empty folders I just transferred over...A side note... This item's order took A FULL WEEK to be processed, before it even had a tracking number. Took two full weeks to show up.Another side note... This items was placed in the same shipping box as a FOURTY POUND ITEM, and there was a bunch of extra space, with no padding. Flash drive was just hanging out, getting pummeled.A+ transaction amazon! (sarcasm)", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 6, 2018", "starRating": "1.0 out of 5 stars", "helpful": "21 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
{"names": "Roman", "reviewerLink": "/gp/profile/amzn1.account.AEIYSVAP2MVBAJTZEFCFSEHN2T5A", "reviewTitles": "And the Answer is:", "reviewBody": "Why these special objects, in this case, the SanDisk 16GB 2.0 Flash Cruzer Glide USB Drive (SDCZ60-16G-B35), I am told is really quite simple to operate. I promise I can read, but I am typically unhappy when I fumble through todays technology regardless of its presumed simplicity or arranged madness for an over-the-hill type such as myself. I still rely on INSTRUCTIONS in order to make wishes, ambitions, and hopes become a reality. In my youth, it took me two days and a roll of surgical tape to learn to shave, and now I struggle with an object without a razor nor shaving cream, its called a SanDisk and I remain befuddled, too human to ask anyone to tell me how to employ the value of this miraculous technological device. . YouTube seems to have the answers, but again this foreign sounding language associated with todays technology adds to my greying hair and high blood pressure. Any ideas for instruction with this product?", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 9, 2018", "starRating": "4.0 out of 5 stars", "helpful": "18 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-128G-B35/product-reviews/B007YX9OGW?pageNumber=2&reviewerType=all_reviews"}
