{"names": "Fult", "reviewerLink": "/gp/profile/amzn1.account.AF326UMQDLPXHYKRWONX7HKAR4DQ", "reviewTitles": "Value Ryzen Laptop", "reviewBody": "First off, don't let the title scare you, it's a great deal. The screen, unlike previous iterations, is gorgeous for the price - crisp and detailed. You can probably find the specs elsewhere complaining about SRGB coverage, but for the average user, sub $500, it's great. Seems like it gets close to 300 nits, definitely bright enough indoors. Keyboard is very nice, not MacBook Air or the like, but very close - much better than Acer/Asus/Samsung. Trackpad along the same lines, very good overall, if you really want to nitpick, the clicking of it wasn't the best on the edges for right/left click. Sound was decent, definitely a laptop speaker and does not get too loud. Fan noise isn't noticeable unless you're used to absolute quiet, the fans spun up under load when setting things up and windows updates, quiet and not grating on the ears. Build quality won't wow anyone at the coffee shop but the plastic resembles brushed metal and it's appealing over, say, the millionth grey laptop. Moderately serviceable under the hood, with one ram stick being soldered on (4 gb). Ignore the other reviews bashing Amazon's delivery service instead of the product itself, this is a sleeper Windows laptop. Highly recommended for research/browsing, writing, and light gaming.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 22, 2021", "starRating": "4.0 out of 5 stars", "helpful": "84 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
{"names": "T is for Tech", "reviewerLink": "/gp/profile/amzn1.account.AG5M4XJ7PPTPJB646DASSEDO5M3Q", "reviewTitles": "Great Portable Laptop", "reviewBody": "I wasn't sure what to expect with this laptop as I haven't ever owned any of the lower end Lenovo machines in the past. I was pleasantly surprised with this one. It's compact and lightweight, great for toting around in your bag without having to have a giant laptop with you. The screen is very nice, although I wish it had slightly higher resolution - but it's ok for most productivity and streaming applications. The keyboard is also very responsive and nice to type on. Trackpad is good, although not as great as something like a Macbook - but this isn't pretending to be that.Pros----------------------* Pretty powerful, the Ryzen processor and Radeon graphics chip are surprisingly good* Can upgrade the memory, there is one slot that has 4GB module in it - I swapped out for an 8GB giving me a total of 12GB of memory* Snappy experience when using, not full of a ton of bloatware - there are a few Lenovo apps but not a ton* Boots up and goes to sleep super fast, very good user experience* Nice assortment of ports on the side, including SD card reader etc...* Fingerprint scanner in the power button is nice for easy unlocking and accessCons---------------------* The overall build quality is \"plastic\" feeling - it looks like metal, but it's plastic. The body will flex if you put stress on the screen hinges, or the front sides. But it's not a huge deal, just something I noticed* The thermals are so-so on this, if you are using it a bunch on your lap - it gets pretty hot. If using on a desk or normal table etc, then it's not bad. The fan is quiet and isn't always running which is good.* Speakers aren't great. You'd be better off with headphones or a better set of desktop speakers if sound quality is a big deal for youAll in all though I was very happy with this device, especially at this price point. The overall package, while having some downsides is a great machine. Battery life seems to be pretty good as well. I haven't yet run a stress test on it - but may do that in the future and update this review.If this was helpful, please give this a helpful rating thumbs up!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 13, 2021", "starRating": "4.0 out of 5 stars", "helpful": "103 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
{"names": "Terrance", "reviewerLink": "/gp/profile/amzn1.account.AFW3CAOLOJI3GGBAIUKTVD73ITMA", "reviewTitles": "Phenomenal Value for the Money", "reviewBody": "This review is for the Lenovo IdeaPad 3 (14ALC6), featuring an AMD Ryzen 5500U processor with integrated Radeon 7 graphics and a 14\" display. I used this as my personal computer for roughly three weeks, and I have to say that I am thoroughly impressed at just how capable and well-rounded this computer is. At less than $500, this IdeaPad 3 is technically a budget laptop, but it is very well equipped and offers incredible performance. In several benchmarks and real-world tests, I was shocked to discover that the 15W Ryzen 5500U matched and sometimes beat my relatively high-end work laptop with a 45W Intel i7-9750H processor that cost more than $2000 at the end of 2019. Feature-wise, the Lenovo IdeaPad 3 offers an attractive thin and light chassis with slim bezels around a 1080p IPS display, and several features such as the webcam with privacy shutter, integrated fingerprint reader, support for Wi-Fi 6, and backlit keyboard were previously exclusive to more premium models. Overall, this laptop is a phenomenal value for everyday computing.In my opinion, the IdeaPad 3's most significant flaw is its USB-C port implementation. Unfortunately, it only has a single USB-C port that's limited to data transfers only. USB Power Delivery and video out functions are not supported. This is very disappointing even for a budget laptop since USB-C PD chargers and multi-function adapters are already widely available, and Google even recommends this functionality for cheap Chromebooks. You are essentially forced to use the proprietary 65W power adapter, which in fairness is pretty compact and lightweight but the power prongs aren't foldable.With respect to gaming performance, the 5500U's integrated Radeon 7 graphics is essentially equivalent to a low-end discrete graphics card such as the nVidia GeForce MX250. The IdeaPad 3 is no gaming powerhouse but it is more than capable of smoothly running less demanding modern titles such as Streets of Rage 4, Genshin Impact (l1080p low preset), Lonely Mountains: Downhill, etc. It can also run some older AAA games like GTA 5 and Metro 2033 at 1080p with low presets. Just for fun, I tried playing Tell Me Why which lists a GTX 1050 as a \"minimum requirement\" and the game ran fine at ~30 FPS at 1080p using medium settings.Something to pay attention to, especially if you're not going to be gaming, is that while the IdeaPad 3 comes with a respectable 8GB of RAM, the default UMA frame buffer size is set to 2GB which means that 2GB is dedicated to the GPU and only 6GB is available to Windows and the rest of your applications. AMD (and Lenovo) do this for compatibility reasons because some games will check the frame buffer size and might throw a warning or otherwise exhibit undesirable behavior such as low-resolution/missing textures if it's too small. In reality, in the case of the 5500U and Radeon 7 graphics, the frame buffer size doesn't matter because the CPU and GPU share a common pool of dynamically allocated memory. If graphics assets exceed the defined UMA frame buffer size, they will automatically consume system memory and the game will continue running with no performance impact. Therefore, I'd recommend setting the UMA frame buffer size to 1GB or less to maximize the size of the shared memory pool.Regarding the software side of things, there are the usual pre-installed programs such as Microsoft 365 and McAfee, a handful of Lenovo-specific utilities such as Vantage, and few surprises such as Amazon's Alexa and Lenovo Voice. For this review, I played with both virtual assistants and found that Alexa worked beautifully; I wish Windows 10 had such a capable and easy-to-use voice assistant built-in. Lenovo Voice, unfortunately, was a total disaster. Not only did it regularly fail to comprehend what I was saying, but the headline functionality such as real-time translation and voice-to-text is only available if you pay. Another unwelcome surprise was that Lenovo Vantage behaved quite differently compared to the version on my ThinkPad. One of the features that I cherish on Lenovo computers is the ability to set battery charging thresholds. In the long run, it's not good for lithium-ion batteries to be kept at 100% state of charge for days-on-end, so this setting allows you to keep the battery partially charged. On my ThinkPad, I can choose between 45% to 100%, but on the IdeaPad 3, the battery conservation mode's threshold is fixed at 55-60% and can't be changed. I prefer keeping my laptop between 70-80% state of charge as a compromise between extending the battery's lifespan and still getting a good amount of time away from the charger.At the end of the day, I really like this laptop. The performance, battery life, and features such as IPS display and fingerprint reader are beyond my expectations. The keyboard, touchpad, and speakers are pretty typical of the class and the only real disappointment is the USB-C port's implementation. Strongly recommended.Notes:1) The IdeaPad 3's Q-Control allows you to configure the AMD Ryzen 5500U's TDP which basically affects CPU/GPU performance and battery life. The default setting is Intelligent Cooling which limits sustained TDP at 15W but allows for brief spikes up to ~22W. The Extreme Performance mode allows for sustained ~28W TDP at the expense of higher operating temperature and fan noise.2) To get into BIOS, you first need to boot into Windows 10 and then from the advanced startup options, choose UEFI firmware settings.3) The Ryzen 5000 family is a bit complicated because some chips have the Zen 2 core and others have Zen 3. The IdeaPad 3's various configurations are all based on Zen 2. Some people might be tempted to compare the 5500U with the previous 4600U since they have the same core count and clock speed, but the 5500U has a faster GPU (one additional core and higher clocks).4) While this IdeaPad 3 has a 1080p IPS panel with a minimum of 45% NTSC color gamut and 300 nits brightness, other specifications such as contrast ratio and response times are not published. That's because Lenovo's support site says that there are 6 equivalent LCD panels that can be used with this model.5) This computer is Windows 11 Ready.6) ** Update 8/16/2021 ** I was visiting a friend and discovered that the Realtek WiFi card couldn't connect to a Ubiquiti access point. I had to go to device manager and disable 5Ghz wireless mode to get it to work.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 8, 2021", "starRating": "4.0 out of 5 stars", "helpful": "79 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
{"names": "Vincent", "reviewerLink": "/gp/profile/amzn1.account.AF63WNMH3YSB6MP3K5CPNJUXVHKA", "reviewTitles": "If you can get this under $500, this is easily the best value laptop in the price range", "reviewBody": "Finding a 5th generation Ryzen in a laptop, let alone a mid-priced consumer grade laptop has been a tremendous challenge lately, but once again, the fellas at Lenovo have done it. Bundle up the newest generation hexa-core AMD processor that otherwise can only be found in laptop configurations ~$200 more expensive with an actually usable amount (256GB) of fast NVME SSD space, enough Vega 7 graphical prowess to chug through your older games and MOBAs and the ability to downrate TDP to 15W so that it runs for 9-10 hours of medium use on a sizable 45Wh battery (can also uprate TDP to 35W so it can boost to 4GHz for processor heavy tasks!), and you have some incredible value. Ram is fast too: 3200MHz out of the box in a dual channel arrangement! Shame you only get a stingy 8GB, but its good enough for most tasks. Wifi is a 2x2 antenna layout for excellent coverage and impressive download speeds. The 1080p IPS is a very welcome addition given all the crappy 1366x768s in this price range, but its nothing to write home about in terms of colors or brightness. Keyboard is inoffensive, with decent travel and slightly raised chiclets for added tactility (backlit too!). Surprisingly impressive mic suite for a laptop, with customizable pickup patterns (forward, forward-wide/cardioid ish, and full 360), but the mics themselves are not very good. Tiny little fingerprint sensor in the power button for all your fingerprint needs.For the less-good: Ideapads are inherently less upgradable, but Lenovo has decided to exchange a 2.5 inch hard drive bay for an extra cell in their battery unit, so no easy fix for the smaller NVME drive short of a replacement and a full reinstall (or get an external HDD). Only 1 slot of the ram is replaceable, with the rest of it neatly soldered onto the motherboard (Lenovo, please stop doing this), and 8GB goes FAST with 2GB already preallocated for the graphics unit. This also means that any additional Ram upgrades you install will only run 8GB in dual channel, with the remainder falling back into single channel. Build quality is workable, but the chassis does feel like a $400-500 consumer laptop (read: cheap and plastic. The blue finish is quite nice though). Don't try to hammer any nails with this. The speakers are terrible and tinny, but Dolby Atmos fills in the gaps quite well if you are forced to listen to them. Camera is solidly mediocre, but has a little privacy slider so the feds don't see you petting your cat for hours on end.Overall: You get what you pay for, and also much, much more in terms of internals. This is the cheapest way to get a very strong processor into a respectable form factor, with the versatility to perform a plethora of productivity and entertainment tasks in a variety of situations. Light and portable at the risk of feeling a tad cheap, but makes up for it with solid internals (despite some minor corner cutting in this department that honestly does not impact common use cases). Get it, slap in a tad more Ram so your stats software doesn't crash and a cheap external HDD, and chug away!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on September 15, 2021", "starRating": "4.0 out of 5 stars", "helpful": "25 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
{"names": "Matthew J. Duane", "reviewerLink": "/gp/profile/amzn1.account.AEGQE6AO3GVBZF3E25D6QOWFDC5Q", "reviewTitles": "Nice value and easy to upgrade", "reviewBody": "I wanted a decently-equipped, lightweight 14-inch laptop to use on the go without breaking the bank and this hit all the notes. I wound up dual-booting it with Pop OS and setup worked well and the 256 GB drive left me more than enough space for a dual install. The memory is partially soldered to the motherboard while another 4 GB stick is replaceable so I swapped that out with an 8 GB one to bump up the system memory to 12 GBs. I believe it can handle up to 20 GB(16 GB stick + 4 GB), and noticed that memory usage in Windows 10 was more stable with the upgrade. That said, 8 GBs is likely more than enough.You can also replace the SSD with another NVMe, though make sure you get the right form factor - it's a 2242 (the smallest one) in case you're looking. But it's quite easy to replace it if you want.I've not tried to stress-test the CPU but I've been able to run a docker image + multiple Chrome tabs + VS code without the fan even kicking on, and my guess is it could handle light-ish gaming as well. For basic office/web/home usage it'll be more than enough. Again, calibrate your expectations but this isn't a bargain-basement device.Screen is solid - it's FHD but at 14 inches you don't see much pixelation and the IPS limits washout from different angles. Brightness is solid as well, though it's certainly not the brightest you'll see. But again, it's good for the price point. And the backlit keyboard has multiple brightness settings depending on the environment.My one big complain is the USB-C port is for data transfer only - no power in or video out. The device has a full-size HDMI port so it's not a deal-breaker but I really would have liked to not have to carry around a device-specific charger. Not a deal breaker but that feels like an unnecessary corner to cut.Still, a good value thus far and I'm happy with how this Ideapad will scale with my needs.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 5, 2021", "starRating": "5.0 out of 5 stars", "helpful": "16 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
{"names": "Bradley Kosowan", "reviewerLink": "/gp/profile/amzn1.account.AFC7BKEC5Z3OVUZAS22ZA7ZAXSYQ", "reviewTitles": "What , imho,  I  think of this laptop", "reviewBody": "As far as gaming it's \"fair\" testing the FPS with Fraps playing FFXIV it eked out 32 fps at best.The display brightness is horrible you have to max it to get a \"decent\" display. It needs major improvement.Audio is low end I have to crank the volume 3-4X the level of my Asus laptops volume.On the Plus side it does handle 3D games just not gaming laptop quality/level.Another plus is the backlit keyboard.I use mine to play FFXIV and it does the job fairly well. Plus other games too.This IS a case of \"You get what you pay for\".Would I recommend it to a friend ? Only if they don't expect dedicated Gaming laptop performance, it's adequate for gaming or what ever.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on September 1, 2021", "starRating": "3.0 out of 5 stars", "helpful": "12 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
{"names": "Chrashing", "reviewerLink": "/gp/profile/amzn1.account.AFUSU7BDTQQYKH4LOVH57LGMIYGQ", "reviewTitles": "Best performance Value computer I could find.", "reviewBody": "edit, Now that I've had this Ideapad 3 14\" for just over a month now and am loving it. While it does not boot faster then my old laptop, when I run code like CURA 3D printing slicer code for example, that runs in 45 seconds where on my old laptop it took 90 seconds. The smaller and lighter footprint/weight of the laptop is significant, and much handier. I have no problem with the display, looks great. It's not fancy, I think of it as a sleeper, modest looking with blazing performance.I replaced a $700 Lenovo Flex 5 14\" so I'll compare to that. The ideapad 3 14 case is plain smooth plastic, but feels sturdier. This ideapad cpu spec is more than 2X faster, and I do see the performance improvement. I never really use the touch screen, so I was happy to give that up. I expect this standard hinge laptop to hold up better than that Flex 360 hinge that broke. What is really nice: This new laptop is 0.8 pounds lighter, about a quarter inch less wide, and an inch less deep with the same size screen, a surprising significant improvement. The new finger print scanner works better. Both are Windows 11 compatible, and have lots of ports to connect with. ​Dislike: The display is fine, but the old Flex seems to have better contrast. The ideapad seems ever so slightly washed out in comparison. Also I'd prefer the power connector on the right side, instead of the left.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on September 13, 2021", "starRating": "5.0 out of 5 stars", "helpful": "3 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
{"names": "Amazon Customer", "reviewerLink": "/gp/profile/amzn1.account.AH2DZAES2CVPV6DS5OPNIR4EGWGQ", "reviewTitles": "piece of junk", "reviewBody": "died today. leave the lid close for an hour and when I opened to continue my work was turned off. cutomer support did not help at all. does not power on. 7 weeks of use and now I have to send it to lenovo and wait for them for a \"repair?\" wait for how long to recieve the same crapy laptop who maybe, if I am lucky enough will maybe last more than 2 months. Dio from cutomer support told me to follow the instructions of an email he send to me to continue help me with the return. he only wanted a positive score and that the problem was resolved. then he ask me to call lenovo myself. if there was a way to take back that feedbak I'll do it. DO NOT BUY IT!!!! you are going to regret it.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 12, 2021", "starRating": "1.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/Lenovo-IdeaPad-Processor-Graphics-82KT00GVUS/product-reviews/B09BG841VC?pageNumber=2&reviewerType=all_reviews"}
