{"names": "Gregory J. Reed", "reviewerLink": "/gp/profile/amzn1.account.AG24HQLUNRSLQWHNDH77VTPWN6ZA", "reviewTitles": "Buy new—bad charge port on my \"Certified Refurbished\" device", "reviewBody": "This product came with a BAD CHARGING PORT, that would not accept a MICRO USB charging cable. In order to charge the reader, I had to use a set of small electronics screwdrivers to carefully manipulate the female port pins into the proper location.Seems as though \"Certified Refurbished\" would mean that someone checked and certified the device for proper operation before selling it ever-so-slightly below the price of a new unit. Truly: buyers should go new and avoid the risk of defects like I have encountered.UPDATE: I have brought this up to three stars because Amazon reached out to ask what they, as a company that cares, could do to fix this problem. I did not ask for anything more than better QA/QC on refurbished products (I'm not the only charge port issue), and decided that since this reader is truly AMAZING: I'd better up my review to reflect the like. Definitely buy this model if you want amazing battery life and ultra-portable reading, but know that you are rolling the dice on quality if you choose refurbished.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 13, 2019", "starRating": "3.0 out of 5 stars", "helpful": "481 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "S. King", "reviewerLink": "/gp/profile/amzn1.account.AE4DVEO343AF4QJ6AHW52EKV7QEQ", "reviewTitles": "Superb device for reading", "reviewBody": "Yay!! My original baby kindle (circa 2011) finally croaked and I tried to get by with my iPad. It was okay but I kept getting headaches and decided to take a chance on the refurbished Paperwhite. I just took a photo of it in full sun so people can see the quality and make their own decisions. I am really pleased with this device even though it is not the same as my original kindle. Change is sometimes difficult- the option of having the backlight is actually surprisingly nice. I also appreciate the touchscreen rather than the clunky search and peck control. This is a good alternative for those on a budget.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 8, 2019", "starRating": "5.0 out of 5 stars", "helpful": "200 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "sara blackman", "reviewerLink": "/gp/profile/amzn1.account.AH4FHDDMWSQHFVTX5ZWZL7Z5WZAQ", "reviewTitles": "*updated- Amazon made it right.", "reviewBody": "I'm leaving my initial review and issues below, but am upgrading my 1star review to 4.less than 10 min after posting my complaint another amazon representative reached out and was able to send a replacement Kindle. So far no issues with the new device and I was happy with the quick and courteous response from Amazon throughout.1* Disappointing,I’m not one to knock a refurbished product, but this one is still broken. The paper white is touted as having WEEKS of battery life but this little bugger won’t even last 5 hours from full charge. I have requested a replacement less than a week after purchase but they are now sold out and unable to offer a replacement only a refund. I’m disappointed since I was really looking forward to the battery life and waterproof aspects.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 11, 2019", "starRating": "4.0 out of 5 stars", "helpful": "172 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "Triple Moon Goddess Indiana", "reviewerLink": "/gp/profile/amzn1.account.AHKYAHJNDHFO775CVXAWFSYDIK2Q", "reviewTitles": "Pleasently surprised!", "reviewBody": "I love my regular Kindle, and although I usually use it in my home, there have been a few times now where i find it hard to see. My husband and I had taken a trip to the beach and I could not see my screen even under the umbrella. I had thought about a Paperwhite, but wasn't sure I would get a lot of use out of it. My new \"regular\" Kindle is often and gets used quiete a bit for the internet, games, and yes reading, some days I run the battery pretty low, this was just another excuse to add a Paperwhite. I ordered a refurbished one hoping I really could see it in bright sun. WOW, I can see it even better than a paper page and there is no reflective glare. I love it! I hope I don't need the water protection feature, but let's face it the bright sun is usually near water. I am very happy with my purchase. I did order a regular wall power cord as I don't like charging off my computer, but all is well and I really love the Paperwhire, the only regret is that it took me so long to buy one.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 10, 2019", "starRating": "5.0 out of 5 stars", "helpful": "133 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "Linda G", "reviewerLink": "/gp/profile/amzn1.account.AHS73L26YZV5JLS7NKEHRQ5BGPKQ", "reviewTitles": "Just like new!", "reviewBody": "I absolutely love my Certified Refurbished Kindle Paperwhite! It looks and operates just like new but for less money! It's the perfect size and can easily slip into my purse. I take it with me everywhere!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on May 19, 2019", "starRating": "5.0 out of 5 stars", "helpful": "93 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "ELMorehead", "reviewerLink": "/gp/profile/amzn1.account.AE47PDO62X74GHRF6ULWTWKMWCIA", "reviewTitles": "Wonderful Increased Memory = You Can Expand Your Library Further! 😀📚💕", "reviewBody": "Thus is a Great Kindle eReader! I purchased this Paperwhite because I ran out of room in my older Paperwhite. So I 💖 the 8GB of Memory! I 💖 that Kindle eReaders are devoted to just Books. It makes finding a specific Collection, without having to scroll thru most of the other collections, much quicker (unlike the Kindle App)! I do most of my reading at night, so I 💖 the backlighting feature. The only Con I've noticed, is that the Charge seems to run out quicker than my previous Paperwhite. I Highly Recommend this Kindle Paperwhite eReader!!📔📖💖", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 17, 2019", "starRating": "5.0 out of 5 stars", "helpful": "73 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "Kindle Customer", "reviewerLink": "/gp/profile/amzn1.account.AHIDFPPHMSFMZ4BNRUTGHZXIKIAA", "reviewTitles": "I can read outside with no problem", "reviewBody": "I enjoy sitting outside to read and it could be very difficult with my kindle fire. I decided to try the paperwhite for that reason. I am able to sit outside even in direct sun and easily read my booksI am very happy with my purchase. I also enjoy the longer lasting battery life.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 6, 2019", "starRating": "5.0 out of 5 stars", "helpful": "71 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "Robert Hills", "reviewerLink": "/gp/profile/amzn1.account.AG5I4SUI7UZ666BUDCA3COCSYIZQ", "reviewTitles": "Refurbished is indistinguishable from new.", "reviewBody": "User interface and readability keeps improving with each new generation.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on May 31, 2019", "starRating": "5.0 out of 5 stars", "helpful": "75 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "PATRICIA", "reviewerLink": "/gp/profile/amzn1.account.AGRAQSXCUSKBRBQWQU2HA3HMXKIQ", "reviewTitles": "Disappointed!", "reviewBody": "My problem with the replacement kindle was that I had purchased a brand new kindle 10 months ago and it quit working. After talking with different helpful techs we could not get it to work. I was instructed to send it back for a replacement. It was still under warranty & I expected a new kindle. I was sent a refurbished one! That’s not why we have warranty’s! I was told that’s your replacement & I could buy another warranty. Not happy!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 21, 2019", "starRating": "1.0 out of 5 stars", "helpful": "47 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
{"names": "LS", "reviewerLink": "/gp/profile/amzn1.account.AHXRNM5UI3APWKIBR6MIBWEKOWEA", "reviewTitles": "Outdated software and perpetual ad bombardment", "reviewBody": "This refurb version has some cons that make it worth considering the purchase of a new one. I originally decided to purchase a refurb for the environmental reuse benefit, and will keep it for that reason, but be warned: 1.) The software will be out of date and the device will malfunction upon receipt. Spend an hour with their custom support and you'll probably get it figured out. This happened with both of my purchases of this item, but only the second time was the support rep able to figure it out, and 2. Your screen will constantly show ads (like the image for this review), unless you pay Amazon $20 for the ability to remove them.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 28, 2019", "starRating": "3.0 out of 5 stars", "helpful": "40 people found this helpful", "nextPage": "/Certified-Refurbished-Kindle-Paperwhite-Ad-Supported/product-reviews/B077448K76?pageNumber=2&reviewerType=all_reviews"}
